balazsgrill/modembed/res/Devices/dsPIC33/DSPIC33EP256MC206.PIC
    </edc:ConfigFuseSector>
    <edc:DeviceIDSector edc:beginaddr="0xff0000" edc:endaddr="0xff0004" edc:mask="0xffff0000" edc:regionid="devid" edc:value="0x1F634000"/>
    <edc:BACKBUGVectorSector edc:beginaddr="0x800000" edc:endaddr="0x800008" edc:regionid="debug"/>
  </edc:ProgramSpace>
  <edc:DataSpace edc:xbeginaddr="0x1000" edc:xendaddr="0x9000" edc:ybeginaddr="0x5000">
    <edc:RegardlessOfMode>
      <edc:SFRDataSector edc:beginaddr="0x0" edc:endaddr="0x1000" edc:regionid="sfrs">
        <edc:Module_ref edc:begin="0x0" edc:end="0x56" edc:modsrc="DOS-00794.Module"/>
        <edc:AdjustPoint edc:offset="2"/>
        <edc:Module_ref edc:begin="0x58" edc:end="0x5a" edc:modsrc="DOS-00794.Module"/>
        <edc:AdjustPoint edc:offset="166"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0x6" edc:modsrc="DOS-00931.Module"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0xe" edc:modsrc="DOS-00932.Module">
          <edc:ModuleMacro edc:replace="%x%" edc:with="2"/>
          <edc:ModuleMacro edc:replace="%y%" edc:with="3"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0xe" edc:modsrc="DOS-00932.Module">
          <edc:ModuleMacro edc:replace="%x%" edc:with="4"/>
          <edc:ModuleMacro edc:replace="%y%" edc:with="5"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="30"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0x8" edc:modsrc="DOS-00942.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="1"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x8" edc:modsrc="DOS-00942.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="2"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x8" edc:modsrc="DOS-00942.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="3"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x8" edc:modsrc="DOS-00942.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="4"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="96"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0x24" edc:modsrc="DOS-00938.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="1"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="28"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0xe" edc:modsrc="DOS-00996.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="1"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="2"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0xe" edc:modsrc="DOS-00996.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="2"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="2"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0xa" edc:modsrc="DOS-00997.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="1"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="6"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0xa" edc:modsrc="DOS-00997.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="2"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="6"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0x6" edc:modsrc="DOS-00998.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="1"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="2"/>
        <edc:Module_ref edc:begin="0x8" edc:end="0xa" edc:modsrc="DOS-00998.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="1"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="22"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0x6" edc:modsrc="DOS-00998.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="2"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="2"/>
        <edc:Module_ref edc:begin="0x8" edc:end="0xa" edc:modsrc="DOS-00998.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="2"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="150"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2a" edc:modsrc="DOS-01041.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="1"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="4"/>
        <edc:Module_ref edc:begin="0x2e" edc:end="0x34" edc:modsrc="DOS-01041.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="1"/>
          <edc:ModuleExclude edc:impl="0xc700" edc:offset="0x2e"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="6"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0x6" edc:modsrc="DOS-01293.Module"/>
        <edc:AdjustPoint edc:offset="768"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0x10" edc:modsrc="DOS-01116.Module"/>
        <edc:AdjustPoint edc:offset="48"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-01017-RPORx.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="0"/>
          <edc:ModuleMacro edc:replace="%x%" edc:with="35"/>
          <edc:ModuleMacro edc:replace="%y%" edc:with="20"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-01017-RPORx.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="1"/>
          <edc:ModuleMacro edc:replace="%x%" edc:with="37"/>
          <edc:ModuleMacro edc:replace="%y%" edc:with="36"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-01017-RPORx.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="2"/>
          <edc:ModuleMacro edc:replace="%x%" edc:with="39"/>
          <edc:ModuleMacro edc:replace="%y%" edc:with="38"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-01017-RPORx.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="3"/>
          <edc:ModuleMacro edc:replace="%x%" edc:with="41"/>
          <edc:ModuleMacro edc:replace="%y%" edc:with="40"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-01017-RPORx.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="4"/>
          <edc:ModuleMacro edc:replace="%x%" edc:with="43"/>
          <edc:ModuleMacro edc:replace="%y%" edc:with="42"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-01017-RPORx.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="5"/>
          <edc:ModuleMacro edc:replace="%x%" edc:with="55"/>
          <edc:ModuleMacro edc:replace="%y%" edc:with="54"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-01017-RPORx.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="6"/>
          <edc:ModuleMacro edc:replace="%x%" edc:with="57"/>
          <edc:ModuleMacro edc:replace="%y%" edc:with="56"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-01017-RPORx.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="7"/>
          <edc:ModuleMacro edc:replace="%x%" edc:with="97"/>
          <edc:ModuleExclude edc:impl="0xffc0" edc:offset="0x0"/>
          <edc:ModuleMacro edc:replace="%y%" edc:with="rsv"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-01017-RPORx.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="8"/>
          <edc:ModuleMacro edc:replace="%x%" edc:with="118"/>
          <edc:ModuleExclude edc:impl="0xffc0" edc:offset="0x0"/>
          <edc:ModuleMacro edc:replace="%y%" edc:with="rsv"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-01017-RPORx.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="9"/>
          <edc:ModuleMacro edc:replace="%y%" edc:with="120"/>
          <edc:ModuleExclude edc:impl="0xc0ff" edc:offset="0x0"/>
          <edc:ModuleMacro edc:replace="%x%" edc:with="rsv"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="12"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-01017-RPINRx.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="0"/>
          <edc:ModuleMacro edc:replace="%x%" edc:with="INT1"/>
          <edc:ModuleMacro edc:replace="%y%" edc:with="RSV"/>
          <edc:ModuleExclude edc:impl="0xff80" edc:offset="0x0"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-01017-RPINRx.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="1"/>
          <edc:ModuleMacro edc:replace="%y%" edc:with="INT2"/>
          <edc:ModuleMacro edc:replace="%x%" edc:with="RSV"/>
          <edc:ModuleExclude edc:impl="0x80ff" edc:offset="0x0"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="2"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-01017-RPINRx.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="3"/>
          <edc:ModuleMacro edc:replace="%y%" edc:with="T2CK"/>
          <edc:ModuleMacro edc:replace="%x%" edc:with="RSV"/>
          <edc:ModuleExclude edc:impl="0x80ff" edc:offset="0x0"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="6"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-01017-RPINRx.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="7"/>
          <edc:ModuleMacro edc:replace="%x%" edc:with="IC2"/>
          <edc:ModuleMacro edc:replace="%y%" edc:with="IC1"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-01017-RPINRx.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="8"/>
          <edc:ModuleMacro edc:replace="%x%" edc:with="IC4"/>
          <edc:ModuleMacro edc:replace="%y%" edc:with="IC3"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="4"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-01017-RPINRx.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="11"/>
          <edc:ModuleMacro edc:replace="%y%" edc:with="OCFA"/>
          <edc:ModuleExclude edc:impl="0x80ff" edc:offset="0x0"/>
          <edc:ModuleMacro edc:replace="%x%" edc:with="RSV"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-01017-RPINRx.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="12"/>
          <edc:ModuleMacro edc:replace="%x%" edc:with="FLT2"/>
          <edc:ModuleMacro edc:replace="%y%" edc:with="FLT1"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="2"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-01017-RPINRx.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="14"/>
          <edc:ModuleMacro edc:replace="%x%" edc:with="QEB1"/>
          <edc:ModuleMacro edc:replace="%y%" edc:with="QEA1"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-01017-RPINRx.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="15"/>
          <edc:ModuleMacro edc:replace="%x%" edc:with="HOME1"/>
          <edc:ModuleMacro edc:replace="%y%" edc:with="INDX1"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="4"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-01017-RPINRx.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="18"/>
          <edc:ModuleMacro edc:replace="%y%" edc:with="U1RX"/>
          <edc:ModuleMacro edc:replace="%X%" edc:with="RSV"/>
          <edc:ModuleExclude edc:impl="0x80ff" edc:offset="0x0"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-01017-RPINRx.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="19"/>
          <edc:ModuleMacro edc:replace="%y%" edc:with="U2RX"/>
          <edc:ModuleMacro edc:replace="%X%" edc:with="RSV"/>
          <edc:ModuleExclude edc:impl="0x80ff" edc:offset="0x0"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="4"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-01017-RPINRx.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="22"/>
          <edc:ModuleMacro edc:replace="%y%" edc:with="SDI2"/>
          <edc:ModuleMacro edc:replace="%x%" edc:with="SCK2"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-01017-RPINRx.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="23"/>
          <edc:ModuleExclude edc:impl="0x80ff" edc:offset="0x0"/>
          <edc:ModuleMacro edc:replace="%y%" edc:with="SS2"/>
          <edc:ModuleMacro edc:replace="%x%" edc:with="RSV"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="4"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-01017-RPINRx.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="26"/>
          <edc:ModuleMacro edc:replace="%y%" edc:with="C1RX"/>
          <edc:ModuleExclude edc:impl="0x80ff" edc:offset="0x0"/>
          <edc:ModuleMacro edc:replace="%x%" edc:with="RSV"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="20"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-01017-RPINRx.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="37"/>
          <edc:ModuleExclude edc:impl="0xff80" edc:offset="0x0"/>
          <edc:ModuleMacro edc:replace="%y%" edc:with="RSV"/>
          <edc:ModuleMacro edc:replace="%x%" edc:with="SYNCI1"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-01017-RPINRx.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="38"/>
          <edc:ModuleExclude edc:impl="0xff80" edc:offset="0x0"/>
          <edc:ModuleMacro edc:replace="%y%" edc:with="RSV"/>
          <edc:ModuleMacro edc:replace="%x%" edc:with="DTCMP1"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-01017-RPINRx.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="39"/>
          <edc:ModuleMacro edc:replace="%y%" edc:with="DTCMP2"/>
          <edc:ModuleMacro edc:replace="%x%" edc:with="DTCMP3"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="56"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0x8" edc:modsrc="DOS-00892.Module"/>
        <edc:AdjustPoint edc:offset="16"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-00804.Module">
          <edc:ModuleExclude edc:impl="0xdbff" edc:offset="0x0"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x8" edc:modsrc="DOS-00826.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="1"/>
          <edc:ModuleExclude edc:impl="0xfffd" edc:offset="0x0"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="4"/>
        <edc:Module_ref edc:begin="0xc" edc:end="0xe" edc:modsrc="DOS-00826.Module"/>
        <edc:AdjustPoint edc:offset="16"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0x8" edc:modsrc="DOS-01287-TLAC-PMDx.Module">
          <edc:ModuleExclude edc:impl="0xfffd" edc:offset="0x0"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="2"/>
        <edc:Module_ref edc:begin="0xa" edc:end="0xe" edc:modsrc="DOS-01287-TLAC-PMDx.Module"/>
        <edc:AdjustPoint edc:offset="146"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0xe" edc:modsrc="DOS-01287_TLAC_INT_.Module">
          <edc:ModuleExclude edc:impl="0xfff3" edc:offset="0x4"/>
          <edc:ModuleExclude edc:impl="0xffbf" edc:offset="0x8"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="2"/>
        <edc:Module_ref edc:begin="0x10" edc:end="0x14" edc:modsrc="DOS-01287_TLAC_INT_.Module"/>
        <edc:AdjustPoint edc:offset="12"/>
        <edc:Module_ref edc:begin="0x20" edc:end="0x2d" edc:modsrc="DOS-01287_TLAC_INT_.Module">
          <edc:ModuleExclude edc:impl="0xfff3" edc:offset="0x24"/>
          <edc:ModuleExclude edc:impl="0x200e" edc:offset="0x28"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="2"/>
        <edc:Module_ref edc:begin="0x30" edc:end="0x34" edc:modsrc="DOS-01287_TLAC_INT_.Module"/>
        <edc:AdjustPoint edc:offset="12"/>
        <edc:Module_ref edc:begin="0x40" edc:end="0x54" edc:modsrc="DOS-01287_TLAC_INT_.Module">
          <edc:ModuleExclude edc:impl="0x00ff" edc:offset="0x50"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="4"/>
        <edc:Module_ref edc:begin="0x58" edc:end="0x5a" edc:modsrc="DOS-01287_TLAC_INT_.Module"/>
        <edc:AdjustPoint edc:offset="2"/>
        <edc:Module_ref edc:begin="0x5c" edc:end="0x5e" edc:modsrc="DOS-01287_TLAC_INT_.Module"/>
        <edc:AdjustPoint edc:offset="2"/>
        <edc:Module_ref edc:begin="0x60" edc:end="0x62" edc:modsrc="DOS-01287_TLAC_INT_.Module"/>
        <edc:AdjustPoint edc:offset="4"/>
        <edc:Module_ref edc:begin="0x66" edc:end="0x68" edc:modsrc="DOS-01287_TLAC_INT_.Module"/>
        <edc:AdjustPoint edc:offset="6"/>
        <edc:Module_ref edc:begin="0x6e" edc:end="0x72" edc:modsrc="DOS-01287_TLAC_INT_.Module"/>
        <edc:AdjustPoint edc:offset="20"/>
        <edc:Module_ref edc:begin="0x86" edc:end="0x8c" edc:modsrc="DOS-01287_TLAC_INT_.Module"/>
        <edc:AdjustPoint edc:offset="52"/>
        <edc:Module_ref edc:begin="0xc0" edc:end="0xca" edc:modsrc="DOS-01287_TLAC_INT_.Module"/>
        <edc:AdjustPoint edc:offset="54"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0xa" edc:modsrc="DOS-00933.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="1"/>
          <edc:ModuleExclude edc:impl="0xfdbf" edc:offset="0x0"/>
          <edc:ModuleExclude edc:impl="0xf9ff" edc:offset="0x2"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0xa" edc:modsrc="DOS-00933.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="2"/>
          <edc:ModuleExclude edc:impl="0xfdbf" edc:offset="0x0"/>
          <edc:ModuleExclude edc:impl="0xf9ff" edc:offset="0x2"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0xa" edc:modsrc="DOS-00933.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="3"/>
          <edc:ModuleExclude edc:impl="0xfdbf" edc:offset="0x0"/>
          <edc:ModuleExclude edc:impl="0xf9ff" edc:offset="0x2"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0xa" edc:modsrc="DOS-00933.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="4"/>
          <edc:ModuleExclude edc:impl="0xfdbf" edc:offset="0x0"/>
          <edc:ModuleExclude edc:impl="0xf9ff" edc:offset="0x2"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="344"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0xc" edc:modsrc="DOS-01424.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="1"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x4" edc:end="0xc" edc:modsrc="DOS-01424.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="2"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x4" edc:end="0xc" edc:modsrc="DOS-01424.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="3"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x4" edc:end="0xc" edc:modsrc="DOS-01424.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="4"/>
          <edc:ModuleExclude edc:impl="0xf3ff" edc:offset="0x4"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="28"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0x28" edc:modsrc="DOS-01332.Module"/>
        <edc:AdjustPoint edc:offset="24"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0x10" edc:modsrc="DOS-00929.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="0"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x10" edc:modsrc="DOS-00929.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="1"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x10" edc:modsrc="DOS-00929.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="2"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x10" edc:modsrc="DOS-00929.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="3"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="176"/>
        <edc:Module_ref edc:begin="0x10" edc:end="0x1c" edc:modsrc="DOS-00929.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="15"/>
          <edc:ModuleExclude edc:impl="0x800f" edc:offset="0x10"/>
          <edc:ModuleExclude edc:impl="0x800f" edc:offset="0x12"/>
          <edc:ModuleExclude edc:impl="0x800f" edc:offset="0x14"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="4"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0x8" edc:modsrc="DOS-00958.Module"/>
        <edc:AdjustPoint edc:offset="2"/>
        <edc:Module_ref edc:begin="0xa" edc:end="0xc" edc:modsrc="DOS-00958.Module"/>
        <edc:AdjustPoint edc:offset="14"/>
        <edc:Module_ref edc:begin="0x1a" edc:end="0x1c" edc:modsrc="DOS-00958.Module"/>
        <edc:AdjustPoint edc:offset="2"/>
        <edc:Module_ref edc:begin="0x1e" edc:end="0x2e" edc:modsrc="DOS-00958.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="1"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="4"/>
        <edc:Module_ref edc:begin="0x032" edc:end="0x36" edc:modsrc="DOS-00958.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="1"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="4"/>
        <edc:Module_ref edc:begin="0x3a" edc:end="0x40" edc:modsrc="DOS-00958.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="1"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x20" edc:end="0x2e" edc:modsrc="DOS-00958.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="2"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="4"/>
        <edc:Module_ref edc:begin="0x032" edc:end="0x036" edc:modsrc="DOS-00958.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="2"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="4"/>
        <edc:Module_ref edc:begin="0x3a" edc:end="0x40" edc:modsrc="DOS-00958.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="2"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x20" edc:end="0x2e" edc:modsrc="DOS-00958.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="3"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="4"/>
        <edc:Module_ref edc:begin="0x032" edc:end="0x036" edc:modsrc="DOS-00958.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="3"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="4"/>
        <edc:Module_ref edc:begin="0x3a" edc:end="0x40" edc:modsrc="DOS-00958.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="3"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="384"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0x10" edc:modsrc="DOS-01117-PORTx.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="A"/>
          <edc:ModuleExclude edc:impl="0x1f93" edc:offset="0x0"/>
          <edc:ModuleExclude edc:impl="0x1f93" edc:offset="0x2"/>
          <edc:ModuleExclude edc:impl="0x1f93" edc:offset="0x4"/>
          <edc:ModuleExclude edc:impl="0x1f93" edc:offset="0x6"/>
          <edc:ModuleExclude edc:impl="0x1f93" edc:offset="0x8"/>
          <edc:ModuleExclude edc:impl="0x1f93" edc:offset="0xa"/>
          <edc:ModuleExclude edc:impl="0x1f93" edc:offset="0xc"/>
          <edc:ModuleExclude edc:impl="0x1813" edc:offset="0xe"/>
        </edc:Module_ref>
