balazsgrill/modembed/res/Devices/dsPIC33/DSPIC33EP256MC206.PIC
        <edc:Module_ref edc:begin="0x0" edc:end="0x10" edc:modsrc="DOS-01117-PORTx.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="B"/>
          <edc:ModuleExclude edc:impl="0x10f" edc:offset="0xe"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x10" edc:modsrc="DOS-01117-PORTx.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="C"/>
          <edc:ModuleExclude edc:impl="0xbfff" edc:offset="0x0"/>
          <edc:ModuleExclude edc:impl="0xbfff" edc:offset="0x2"/>
          <edc:ModuleExclude edc:impl="0xbfff" edc:offset="0x4"/>
          <edc:ModuleExclude edc:impl="0xbfff" edc:offset="0x6"/>
          <edc:ModuleExclude edc:impl="0xbfff" edc:offset="0x8"/>
          <edc:ModuleExclude edc:impl="0xbfff" edc:offset="0xa"/>
          <edc:ModuleExclude edc:impl="0xbfff" edc:offset="0xc"/>
          <edc:ModuleExclude edc:impl="0x807" edc:offset="0xe"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0xe" edc:modsrc="DOS-01117-PORTx.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="D"/>
          <edc:ModuleExclude edc:impl="0x160" edc:offset="0x6"/>
          <edc:ModuleExclude edc:impl="0x0" edc:offset="0xe"/>
          <edc:ModuleExclude edc:impl="0x160" edc:offset="0x2"/>
          <edc:ModuleExclude edc:impl="0x160" edc:offset="0x4"/>
          <edc:ModuleExclude edc:impl="0x160" edc:offset="0x8"/>
          <edc:ModuleExclude edc:impl="0x160" edc:offset="0xa"/>
          <edc:ModuleExclude edc:impl="0x160" edc:offset="0xc"/>
          <edc:ModuleExclude edc:impl="0x160" edc:offset="0x0"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="2"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0x10" edc:modsrc="DOS-01117-PORTx.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="E"/>
          <edc:ModuleExclude edc:impl="0xf000" edc:offset="0x0"/>
          <edc:ModuleExclude edc:impl="0xf000" edc:offset="0x2"/>
          <edc:ModuleExclude edc:impl="0xf000" edc:offset="0x4"/>
          <edc:ModuleExclude edc:impl="0xf000" edc:offset="0x6"/>
          <edc:ModuleExclude edc:impl="0xf000" edc:offset="0x8"/>
          <edc:ModuleExclude edc:impl="0xf000" edc:offset="0xa"/>
          <edc:ModuleExclude edc:impl="0xf000" edc:offset="0xc"/>
          <edc:ModuleExclude edc:impl="0xf000" edc:offset="0xe"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0xe" edc:modsrc="DOS-01117-PORTx.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="F"/>
          <edc:ModuleExclude edc:impl="0x3" edc:offset="0x0"/>
          <edc:ModuleExclude edc:impl="0x3" edc:offset="0x2"/>
          <edc:ModuleExclude edc:impl="0x3" edc:offset="0x4"/>
          <edc:ModuleExclude edc:impl="0x3" edc:offset="0x6"/>
          <edc:ModuleExclude edc:impl="0x3" edc:offset="0x8"/>
          <edc:ModuleExclude edc:impl="0x3" edc:offset="0xa"/>
          <edc:ModuleExclude edc:impl="0x3" edc:offset="0xc"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="2"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0xe" edc:modsrc="DOS-01117-PORTx.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="G"/>
          <edc:ModuleExclude edc:impl="0x3c0" edc:offset="0x0"/>
          <edc:ModuleExclude edc:impl="0x3c0" edc:offset="0x2"/>
          <edc:ModuleExclude edc:impl="0x3c0" edc:offset="0x4"/>
          <edc:ModuleExclude edc:impl="0x3c0" edc:offset="0x6"/>
          <edc:ModuleExclude edc:impl="0x3c0" edc:offset="0x8"/>
          <edc:ModuleExclude edc:impl="0x3c0" edc:offset="0xa"/>
          <edc:ModuleExclude edc:impl="0x3c0" edc:offset="0xc"/>
          <edc:ModuleExclude edc:impl="0x3c0" edc:offset="0xe"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="274"/>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="FEXL" edc:desc="" edc:impl="0xffff" edc:ishidden="true" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="FEXL" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FEXL" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="FEXL" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="r" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--------nnnnnnnn" edc:cname="FEXU" edc:desc="" edc:impl="0x0" edc:ishidden="true" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------00000000" edc:name="FEXU" edc:nzwidth="0x10" edc:por="--------00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FEXU" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="FEXU" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="4"/>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="VISI" edc:desc="" edc:impl="0xffff" edc:ishidden="true" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="VISI" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="VISI" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="VISI" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="r" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="DPCL" edc:desc="" edc:impl="0xffff" edc:ishidden="true" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="DPCL" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DPCL" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="DPCL" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="r" edc:stimtype="Integer"/>
        </edc:SFRDef>
